isliulin/huaxin/nbk/Nikon/NikonStm32/nikon_stm32/SYSTEM/delay/delay.c
//#include <stm32f10x_lib.h>
#include "stm32f10x.h"
#include "delay.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//Mini STM32开发板
//使用SysTick的普通计数模式对延迟进行管理
//包括delay_us,delay_ms
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2010/5/27
//版本：V1.2
//版权所有，盗版必究。
//Copyright(C) 正点原子 2009-2019
//All rights reserved
//********************************************************************************
//V1.2修改说明
//修正了中断中调用出现死循环的错误
//防止延时不准确,采用do while结构!
//////////////////////////////////////////////////////////////////////////////////	 
//static u8  fac_us=0;//us延时倍乘数
//static u16 fac_ms=0;//ms延时倍乘数
u8  fac_us=0;
u16 fac_ms=0;
//初始化延迟函数
//SYSTICK的时钟固定为HCLK时钟的1/8
//SYSCLK:系统时钟
void delay_init(u8 SYSCLK)
{
	SysTick->CTRL&=0xfffffffb;//bit2清空,选择外部时钟  HCLK/8
	fac_us=SYSCLK/8;		    
	fac_ms=(u16)fac_us*1000;
}								    
//延时nms
//注意nms的范围
//SysTick->LOAD为24位寄存器,所以,最大延时为:
//nms<=0xffffff*8*1000/SYSCLK
//SYSCLK单位为Hz,nms单位为ms
//对72M条件下,nms<=1864 

void delay_ms(u16 nms)
{	 		  	  
	u32 temp=0;
	u32 loadRsv = SysTick->LOAD;
	u8 ctrlRsv = SysTick->CTRL;	
	u8 valRsv = SysTick->VAL;
	//rsv = SysTick->CTRL;
	SysTick->LOAD=(u32)nms*fac_ms;//时间加载(SysTick->LOAD为24bit)
	SysTick->VAL =0x00;           //清空计数器
	SysTick->CTRL=0x01 ;          //开始倒数  
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));//等待时间到达   
	//SysTick->CTRL=0x00;       //关闭计数器
	SysTick->CTRL=ctrlRsv;
	SysTick->LOAD=loadRsv;
	SysTick->VAL = valRsv;
	//SysTick->VAL =0X00;       //清空计数器	  	    
}   
//延时nus
//nus为要延时的us数.		    								   
void delay_us(u32 nus)
{		
	u32 temp;	    	 
	u32 loadRsv = SysTick->LOAD;
	u8 ctrlRsv = SysTick->CTRL;	
	u8 valRsv = SysTick->VAL;
	SysTick->LOAD=nus*fac_us; //时间加载	  		 
	SysTick->VAL=0x00;        //清空计数器
	SysTick->CTRL=0x01 ;      //开始倒数 	 
	do
	{
		temp=SysTick->CTRL;
	}
	while(temp&0x01&&!(temp&(1<<16)));//等待时间到达   
	SysTick->CTRL=ctrlRsv;
	SysTick->LOAD=loadRsv;
	SysTick->VAL = valRsv;
	//SysTick->CTRL=0x00;       //关闭计数器
	//SysTick->CTRL = rsv;
	//SysTick->VAL =0X00;       //清空计数器	 
}

void delay_seconds(u16 ns)
{
	while(ns--)
	{
		delay_ms(1000);
	}
}



































